Revit 2024 API
UpdaterRegistry.UnregisterUpdater Method (UpdaterId)
 Removes the updater associated with the input id from the UpdaterRegistry. Also removes all triggers associated with the Updater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static void UnregisterUpdater(
	UpdaterId id
)
Visual Basic
Public Shared Sub UnregisterUpdater ( _
	id As UpdaterId _
)
Visual C++
public:
static void UnregisterUpdater(
	UpdaterId^ id
)
Parameters
id
Type: Autodesk.Revit.DB.UpdaterId
 Id of updater to be removed
Remarks
 This methods works regardless of how the updater was registered. Whether the updater was registered application-wide or for a document (or a set of document), it will be removed from the registry and any connections with documents will also be lost.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Updater with this Id is not currently registered in Revit.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The updater's owner's AddIn does not match the currently active AddIn, i.e. IUpdater.GetUpdaterId().GetAddInId() differs from the addInId field in the manifest file of the currently executing external application. -or- Attempting to unregister an updater that is currently being executed.
See Also
UpdaterRegistry Class
UnregisterUpdater Overload
Autodesk.Revit.DB Namespace